/* Data Types

bool          // 所占字节数：1    // 最大值：1                      // 最小值：0

char          // 所占字节数：1    // 最大值：                       // 最小值：?

signed char   // 所占字节数：1    // 最大值：                       // 最小值：?

unsigned char // 所占字节数：1    // 最大值：?                      // 最小值：

wchar_t       // 所占字节数：4    // 最大值：2147483647             // 最小值：-2147483648

short         // 所占字节数：2    // 最大值：32767                  // 最小值：-32768

int           // 所占字节数：4    // 最大值：2147483647             // 最小值：-2147483648

unsigned      // 所占字节数：4    // 最大值：4294967295             // 最小值：0

long          // 所占字节数：8    // 最大值：9223372036854775807    // 最小值：-9223372036854775808
 
unsigned long // 所占字节数：8    // 最大值：18446744073709551615   // 最小值：0

double        // 所占字节数：8    // 最大值：1.79769e+308           // 最小值：2.22507e-308

long double   // 所占字节数：16   // 最大值：1.18973e+4932          // 最小值：3.3621e-4932

float         // 所占字节数：4    // 最大值：3.40282e+38            // 最小值：1.17549e-38

size_t        // 所占字节数：8    // 最大值：18446744073709551615   // 最小值：0

string        // 所占字节数：24

*/